rt/ws/security/src/test/java/org/apache/cxf/ws/security/wss4j/signed_missing_signed_body.xml

<soapenv:Envelope xmlns:ser="http://blah" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:Signature Id="Signature-9" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="#id-10">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>sLqsvlWXRWziGUK7j1LuqHzIGKg=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#id-8">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>TJj4H4XAG1HaH/gPprXOv5zwkXQ=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
DQ4W/xmahVdPAFqnyFmCjaTqvvJJ5Vn5QI9CnS2AvojUuKrxNfE8s2aiMAd8vpjQj3ACg1gqP8xG
kGfJvVuKsRQko3ej/KuDZNGT5Jb5ONOECVkG1EDlbcejxECU+BhuVrObB2idmS1gc57ApuGGsLQy
fe+JAqQ8QseAAqIsgas=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-B5419464DCB3C8B05A126471035842914">
<wsse:SecurityTokenReference wsu:Id="STRId-B5419464DCB3C8B05A126471035842915" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:X509Data>
<ds:X509IssuerSerial>
<ds:X509IssuerName>CN=myAlias</ds:X509IssuerName>
<ds:X509SerialNumber>1181668586</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature></wsse:Security>
      <Header wsu:Id="id-10" xmlns="http://www.sdj.pl" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">1234</Header>
      <Header wsu:Id="id-8" xmlns="http://www.sdj.pl" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">5678</Header>
   </soapenv:Header>
   <soapenv:Body>
     <echo xmlns="http://www.sdj.pl">
       <in0>A</in0>    
     </echo>
   </soapenv:Body>
</soapenv:Envelope>
